

//KC03A48E JOB REGION=0M,CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID,
//*        TYPRUN=SCAN,
//*---------------------------------------------------------------
//PASO01   EXEC PGM=PLISNOTA
//INPAIS   DD DNS=,DIPS=SHR
//INMATE   DD DNS=,DIPS=SHR
//INALU    DD DNS=,DIPS=SHR
//INNOTA   DD DNS=,DIPS=SHR
//OUCORTE  DD DSN=,DIPS=(NEW,CATLG,DELETE),
//         DCB=(RECFM=FB,LRECL=567,BLKSIZE=0,DSORG=PS),
//         SPACE=(CYL,(1,1),RLSE) 
        