//PASO0070 EXEC PGM=OSGENER,COND=(A,LT)
//SYSLST   DD SYSOUT=*
//SYSUT    DD DSN=ARBP.SO.SECU.FSO403S,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(50,10),RLSE),
//         DCB=(LRECL=30,BLKSIZE=0,RECFM=FB),
//         UNIT=SYSDA
//SYSIN    DD *
SELEC      1,3,,1/';',4
SELEC      199,2,PZ,5,3/';',8
SELEC      217,2,PZ,9,3/';',12
SELEC      219,2,PZ,13,3/';',16
SELEC      221,4,,17/';',21
SELEC      225,2,PZ,22,3/';',25
SELEC      4,3,PZ,26,5
/*