

//KC03A48E JOB REGION=0M,CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID,
//*        TYPRUN=SCAN,
//         RESTART=PASO02
//
//PASO01   EXEC PGM=PLISNOTA,  
//         DD DSN=KC03A48.NOTAS.DAT,DISP=SHR
//         DD DSN=KC03A48.ALUMNOS.DAT,DISP=SHR
//         DD DSN=KC03A48.MATERIAS.DAT,DISP=(NEW,CATLG,DELETE),
//
//         DD DSN=KC03A48.NACIONAL.DAT,DISP=(NEW,CATLG,DELETE),
//
//         DD DSN=KC03A48.PLISNOTA.DAT,DISP=(NEW,CATLG,DELETE),